### DataFrame 행/열 삭제

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# 데이터 준비
data={'name': ['홍길동','마징가','원더우먼'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100, 200, 300],
      'height':[180, 300, 200]}

In [3]:
# DF으로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [실습] 행 삭제 : 변수명.drop()메서드 >> 매개변수(axis등등) 잘보것
    - 변수명.drop(Labels, axis=0) : axis의 설정 값에 따라 행(0 = 기본값)또는 열(1) 삭제 진행
    - 변수명.drop(index) : 지정된 인덱스의 행 삭제

In [4]:
# 1개 행 삭제 --> 기본값 : 행 삭제, 원본 변경X
dataDF.drop(1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [53]:
# 변수명.drop(슬라이싱 가능, (axis=0))
# 2개 행 삭제 --> 기본값 : 행 삭제, 원본 변경X
dataDF.drop([0,2])

  name job gender  age  height
1  마징가  로봇      남  200     300

In [54]:
# 2개 행 삭제 시 --> 기본값 : 행 삭제(axis=0), 원본 변경X
# if 원본 삭제하고 싶으면 매개변수 inplace=True 이용, 기본값은 False
# dataDF.drop([0,2], inplace=True)
# dataDF >>> 위 아래 실행됨 근데 inplace때매 저장되버려서 얼린거임 ㅋㅋㅋ

In [7]:
#변수명.drop(index/columns=각 위치에 저장)
dataDF.drop(index=dataDF.index[1:])
#변수명.drop(index설정 > dataDF.index로 슬라이싱해서 지정)

  name job gender  age  height
0  홍길동  의적      남  100     180

In [8]:
dataDF.drop(columns=dataDF.columns[1:])
#변수명.drop(index설정 > dataDF.index로 슬라이싱해서 지정)

   name
0   홍길동
1   마징가
2  원더우먼

- [실습] 열/컬럼 삭제 : 변수명.drop(라벨명,axis=1 또는 axis='columns')메서드
                      >>삭제 방향 즉, 기준을 열로 설정 필수
    - 변수명.drop(Labels, axis=0) : axis의 설정 값에 따라 행(0 > 기본값)
                                    또는 열(1) 삭제 진행
    - 변수명.drop(columns) : 지정된 인덱스의 열 삭제

In [56]:
## age컬럼을 삭제
dataDF.drop('age',axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [57]:
dataDF.drop('age',axis='columns')

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [58]:
# gender, height 컬럼 삭제
dataDF.drop(['gender', 'height'],axis='columns') # 원본 변경 안됨

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [9]:
dataDF.drop(dataDF.columns[2::2], axis='columns') # 슬라이싱 하고 싶으면

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300

In [60]:
dataDF.drop(columns=dataDF.columns[::2])

  job  age
0  의적  100
1  로봇  200
2  영웅  300